read_systemverilog -sv rtl/top.sv
hierarchy -top top
synth -flatten -top top
stat
write_json synth/out.json
