plugin -i systemverilog
read_systemverilog -sv rtl/top.sv
hierarchy -top top
proc
opt
check
write_json synth/out.json
