# running in formal/top_protocol/src/
read -formal -sv -I ../../.. -I ../../../verification top.sv props.sv bind_protocol.sv
prep -top top

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
